### 1.	Получить файл (Titanic.csv) набора данных, прилагающийся к этой работе.
### 2.	Считать файл в pandas DataFrame

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('Titanic.csv')
data

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0
1312,"Zimmerman, Leo",3rd,29.00,male,0

### 3.	Ознакомиться с основными параметрами датасета, используя функции библиотеки pandas, включая следующие данные:

    a. Количество точек данных (измерений) в наборе

In [3]:
data.shape[0] - 1

1312

    b.Количество полей данных (атрибутов)

In [4]:
data.shape[1]

5

    c.Тип данных каждого поля, шкала каждого поля

In [5]:
data.dtypes

Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
dtype: object

In [6]:
columns_names = data.columns.values.tolist()
for i in columns_names:
    print(data[i].describe(), '\n')

count                    1313
unique                   1310
top       Connolly, Miss Kate
freq                        2
Name: Name, dtype: object

count     1312
unique       3
top        3rd
freq       711
Name: PClass, dtype: object

count    756.000000
mean      30.397989
std       14.259049
min        0.170000
25%       21.000000
50%       28.000000
75%       39.000000
max       71.000000
Name: Age, dtype: float64

count     1313
unique       2
top       male
freq       851
Name: Sex, dtype: object

count    1313.000000
mean        0.342727
std         0.474802
min         0.000000
25%         0.000000
50%         0.000000
75%         1.000000
max         1.000000
Name: Survived, dtype: float64

    d.Количество отсутствующих значений для каждого поля

In [7]:
for i in columns_names:
    print(i, data[i].isna().sum(axis=0))

Name 0
PClass 1
Age 557
Sex 0
Survived 0

    e.Количество и названия константных и уникальных полей

In [8]:
print("Константные поля:")
lst = data.columns[data.nunique() < 10]
for i in lst:
    print(f"{i} - {data[i].nunique()}")

Константные поля:
PClass - 3
Sex - 2
Survived - 2

In [9]:
print("Уникальные поля:")
lst = data.columns[data.nunique() > 10]
for i in lst:
    print(f"{i} - {data[i].nunique()}")

Уникальные поля:
Name - 1310
Age - 75

### 4.	Удалить из набора поля, не несущие информативной нагрузки - содержащие уникальные либо константные значения.

In [10]:
data = data.drop('PClass', 1)
data = data.drop('Sex', 1)
data

/var/folders/sw/wn373rfs4tsg521_54p46y4m0000gn/T/ipykernel_8116/900376465.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  data = data.drop('PClass', 1)
/var/folders/sw/wn373rfs4tsg521_54p46y4m0000gn/T/ipykernel_8116/900376465.py:2: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  data = data.drop('Sex', 1)

                                               Name    Age  Survived
0                      Allen, Miss Elisabeth Walton  29.00         1
1                       Allison, Miss Helen Loraine   2.00         0
2               Allison, Mr Hudson Joshua Creighton  30.00         0
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)  25.00         0
4                     Allison, Master Hudson Trevor   0.92         1
...                                             ...    ...       ...
1308                             Zakarian, Mr Artun  27.00         0
1309                         Zakarian, Mr Maprieder  26.00         0
1310                               Zenni, Mr Philip  22.00         0
1311                               Lievens, Mr Rene  24.00         0
1312                                 Zimmerman, Leo  29.00         0

[1313 rows x 3 columns]

### 5.	Заменить возраст пассажиров на год рождения.

In [11]:
data['Age'] = round(1912 - data['Age'])
data

                                               Name     Age  Survived
0                      Allen, Miss Elisabeth Walton  1883.0         1
1                       Allison, Miss Helen Loraine  1910.0         0
2               Allison, Mr Hudson Joshua Creighton  1882.0         0
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)  1887.0         0
4                     Allison, Master Hudson Trevor  1911.0         1
...                                             ...     ...       ...
1308                             Zakarian, Mr Artun  1885.0         0
1309                         Zakarian, Mr Maprieder  1886.0         0
1310                               Zenni, Mr Philip  1890.0         0
1311                               Lievens, Mr Rene  1888.0         0
1312                                 Zimmerman, Leo  1883.0         0

[1313 rows x 3 columns]

### 6.	Переименовать все названия колонок на русском языке.

In [12]:
data = data.rename(columns={"Name":"Имя", "Age":"Год рождения", "Survived":"Выжил(а)"})
data

                                                Имя  Год рождения  Выжил(а)
0                      Allen, Miss Elisabeth Walton        1883.0         1
1                       Allison, Miss Helen Loraine        1910.0         0
2               Allison, Mr Hudson Joshua Creighton        1882.0         0
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)        1887.0         0
4                     Allison, Master Hudson Trevor        1911.0         1
...                                             ...           ...       ...
1308                             Zakarian, Mr Artun        1885.0         0
1309                         Zakarian, Mr Maprieder        1886.0         0
1310                               Zenni, Mr Philip        1890.0         0
1311                               Lievens, Mr Rene        1888.0         0
1312                                 Zimmerman, Leo        1883.0         0

[1313 rows x 3 columns]

### 7.	Заменить все отсутствующие данные средним значением (в случае числового поля) либо самым распространенным в категориальных полях.

In [13]:
age_mean = int(data['Год рождения'].mean())
data['Год рождения'] = data['Год рождения'].fillna(age_mean)
data['Год рождения'] = data['Год рождения'].astype(int) # Меняем тип на int
data

                                                Имя  Год рождения  Выжил(а)
0                      Allen, Miss Elisabeth Walton          1883         1
1                       Allison, Miss Helen Loraine          1910         0
2               Allison, Mr Hudson Joshua Creighton          1882         0
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)          1887         0
4                     Allison, Master Hudson Trevor          1911         1
...                                             ...           ...       ...
1308                             Zakarian, Mr Artun          1885         0
1309                         Zakarian, Mr Maprieder          1886         0
1310                               Zenni, Mr Philip          1890         0
1311                               Lievens, Mr Rene          1888         0
1312                                 Zimmerman, Leo          1883         0

[1313 rows x 3 columns]

In [14]:
# Проверка на количество пустых значений
data['Год рождения'].isna().sum(axis=0)

0

### 8.	Сохранить получившийся набор данных в формате CSV в файле ФИО_Titanic.csv.

In [15]:
data.to_csv('Мамедова_Лейла_Али-агаевна_Titanic.csv', encoding='utf-8', index=False)

### 9.	Открыть данный файл в программе Microsoft Excel и сохранить в формате .xlsx
### 10.	Считать файл .xlsx в новый DataFrame

In [16]:
data_from_excel = pd.read_excel('Мамедова_Лейла_Али-агаевна_Titanic.xlsx')
data_from_excel

                                                Имя  Год рождения  Выжил(а)
0                      Allen, Miss Elisabeth Walton          1883         1
1                       Allison, Miss Helen Loraine          1910         0
2               Allison, Mr Hudson Joshua Creighton          1882         0
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)          1887         0
4                     Allison, Master Hudson Trevor          1911         1
...                                             ...           ...       ...
1308                             Zakarian, Mr Artun          1885         0
1309                         Zakarian, Mr Maprieder          1886         0
1310                               Zenni, Mr Philip          1890         0
1311                               Lievens, Mr Rene          1888         0
1312                                 Zimmerman, Leo          1883         0

[1313 rows x 3 columns]